In [1]:
import numpy as np
from pandas import Series, DataFrame 
import pandas as pd

In [15]:
ser1 = Series([2,np.nan,5,7,np.nan ,np.nan], index = ['S','F','R','T','Y','U'])

In [3]:
ser2 = Series(np.arange(len(ser1)), dtype=np.float64, index =['S','F','R','T','Y','U'] )

In [16]:
ser1

S    2.0
F    NaN
R    5.0
T    7.0
Y    NaN
U    NaN
dtype: float64

In [5]:
ser2

S    0.0
F    1.0
R    2.0
T    3.0
Y    4.0
U    5.0
dtype: float64

In [17]:
Series(np.where(pd.isnull(ser1), ser2, ser1), index=ser1.index)   #when the ser1 is null put ser2, else put ser1

S    2.0
F    1.0
R    5.0
T    7.0
Y    4.0
U    5.0
dtype: float64

In [18]:
ser1.combine_first(ser2)    # do the same as the upper line

S    2.0
F    1.0
R    5.0
T    7.0
Y    4.0
U    5.0
dtype: float64

In [24]:
dframe1 = DataFrame({'X':[1, np.nan , 3],
                    'Y':[np.nan, np.nan , 5],
                    'z':[7, np.nan , np.nan]})

In [31]:
dframe2 = DataFrame({'X':[2, 4, np.nan,6],
                    'Y':[np.nan, 8 ,10,12]})

In [25]:
dframe1

     X    Y    z
0  1.0  NaN  7.0
1  NaN  NaN  NaN
2  3.0  5.0  NaN

In [32]:
dframe2

     X     Y
0  2.0   NaN
1  4.0   8.0
2  NaN  10.0
3  6.0  12.0

In [33]:
dframe1.combine_first(dframe2)

     X     Y    z
0  1.0   NaN  7.0
1  4.0   8.0  NaN
2  3.0   5.0  NaN
3  6.0  12.0  NaN